zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_ADC.h
#define ADC_GC2_GAIN13_MASK                      (0xC00U)
#define ADC_GC2_GAIN13_SHIFT                     (10U)
/*! GAIN13 - Gain Control Bit 13
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC2_GAIN13(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC2_GAIN13_SHIFT)) & ADC_GC2_GAIN13_MASK)

#define ADC_GC2_GAIN14_MASK                      (0x3000U)
#define ADC_GC2_GAIN14_SHIFT                     (12U)
/*! GAIN14 - Gain Control Bit 14
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC2_GAIN14(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC2_GAIN14_SHIFT)) & ADC_GC2_GAIN14_MASK)

#define ADC_GC2_GAIN15_MASK                      (0xC000U)
#define ADC_GC2_GAIN15_SHIFT                     (14U)
/*! GAIN15 - Gain Control Bit 15
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC2_GAIN15(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC2_GAIN15_SHIFT)) & ADC_GC2_GAIN15_MASK)
/*! @} */

/*! @name SCTRL - ADC Scan Control Register */
/*! @{ */

#define ADC_SCTRL_SC_MASK                        (0xFFFFU)
#define ADC_SCTRL_SC_SHIFT                       (0U)
/*! SC - Scan Control Bits
 *  0b0000000000000000..Perform sample immediately after the completion of the current sample.
 *  0b0000000000000001..Delay sample until a new sync input occurs.
 */
#define ADC_SCTRL_SC(x)                          (((uint16_t)(((uint16_t)(x)) << ADC_SCTRL_SC_SHIFT)) & ADC_SCTRL_SC_MASK)
/*! @} */

/*! @name PWR2 - ADC Power Control Register */
/*! @{ */

#define ADC_PWR2_SPEEDA_MASK                     (0x3U)
#define ADC_PWR2_SPEEDA_SHIFT                    (0U)
/*! SPEEDA - ADCA Speed Control Bits
 *  0b00..Conversion clock frequency <= 5 MHz; current consumption per converter = 5 mA
 *  0b01..Conversion clock frequency <= 10 MHz; current consumption per converter = 9 mA
 *  0b10..Conversion clock frequency <= 15 MHz; current consumption per converter = 15 mA
 *  0b11..Conversion clock frequency <= 20 MHz; current consumption per converter = 21 mA
 */
#define ADC_PWR2_SPEEDA(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_PWR2_SPEEDA_SHIFT)) & ADC_PWR2_SPEEDA_MASK)

#define ADC_PWR2_SPEEDB_MASK                     (0xCU)
#define ADC_PWR2_SPEEDB_SHIFT                    (2U)
/*! SPEEDB - ADCB Speed Control Bits
 *  0b00..Conversion clock frequency <= 5 MHz; current consumption per converter = 5 mA
 *  0b01..Conversion clock frequency <= 10 MHz; current consumption per converter = 9 mA
 *  0b10..Conversion clock frequency <= 15 MHz; current consumption per converter = 15 mA
 *  0b11..Conversion clock frequency <= 20 MHz; current consumption per converter = 21 mA
 */
#define ADC_PWR2_SPEEDB(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_PWR2_SPEEDB_SHIFT)) & ADC_PWR2_SPEEDB_MASK)

#define ADC_PWR2_DIV1_MASK                       (0x3F00U)
#define ADC_PWR2_DIV1_SHIFT                      (8U)
/*! DIV1 - Clock Divisor Select */
#define ADC_PWR2_DIV1(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_PWR2_DIV1_SHIFT)) & ADC_PWR2_DIV1_MASK)
/*! @} */

/*! @name CTRL3 - ADC Control Register 3 */
/*! @{ */

#define ADC_CTRL3_SCNT0_MASK                     (0x7U)
#define ADC_CTRL3_SCNT0_SHIFT                    (0U)
/*! SCNT0 - Sample Window Count 0 */
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_CTRL3_SCNT0_SHIFT)) & ADC_CTRL3_SCNT0_MASK)

#define ADC_CTRL3_SCNT1_MASK                     (0x38U)
#define ADC_CTRL3_SCNT1_SHIFT                    (3U)
/*! SCNT1 - Sample Window Count 1 */
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_CTRL3_SCNT1_SHIFT)) & ADC_CTRL3_SCNT1_MASK)

#define ADC_CTRL3_DMASRC_MASK                    (0x40U)
#define ADC_CTRL3_DMASRC_SHIFT                   (6U)
/*! DMASRC - DMA Trigger Source
 *  0b0..DMA trigger source is end of scan interrupt
 *  0b1..DMA trigger source is RDY bits
 */
#define ADC_CTRL3_DMASRC(x)                      (((uint16_t)(((uint16_t)(x)) << ADC_CTRL3_DMASRC_SHIFT)) & ADC_CTRL3_DMASRC_MASK)
/*! @} */

/*! @name SCHLTEN - ADC Scan Halted Interrupt Enable Register */
/*! @{ */

#define ADC_SCHLTEN_SCHLTEN_MASK                 (0xFFFFU)
#define ADC_SCHLTEN_SCHLTEN_SHIFT                (0U)
/*! SCHLTEN - Scan Halted Interrupt Enable
 *  0b0000000000000000..Scan halted interrupt is not enabled for this sample.
 *  0b0000000000000001..Scan halted interrupt is enabled for this sample.
 */
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_SCHLTEN_SCHLTEN_SHIFT)) & ADC_SCHLTEN_SCHLTEN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ADC_Register_Masks */


/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ADC_H_ */

